## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.tf-aks must be replaced
-/+ resource "azurerm_kubernetes_cluster" "tf-aks" {
      - cost_analysis_enabled               = false -> null
      ~ current_kubernetes_version          = "1.29.9" -> (known after apply)
      ~ fqdn                                = "tf-aks-cluster-dns-sy5jv6lj.hcp.northeurope.azmk8s.io" -> (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      ~ id                                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/tf-aks-rg/providers/Microsoft.ContainerService/managedClusters/tf-aks-cluster" -> (known after apply)
      ~ kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      ~ kubernetes_version                  = "1.29" -> (known after apply)
      - local_account_disabled              = false -> null
        name                                = "tf-aks-cluster"
      ~ node_resource_group                 = "MC_tf-aks-rg_tf-aks-cluster_northeurope" -> (known after apply)
      ~ node_resource_group_id              = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/MC_tf-aks-rg_tf-aks-cluster_northeurope" -> (known after apply)
      - oidc_issuer_enabled                 = false -> null
      + oidc_issuer_url                     = (known after apply)
      ~ portal_fqdn                         = "tf-aks-cluster-dns-sy5jv6lj.portal.hcp.northeurope.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
        tags                                = {
            "Environment" = "Dev"
            "Owner"       = "kmiszel"
            "Source"      = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ auto_scaler_profile (known after apply)

      ~ default_node_pool {
          ~ auto_scaling_enabled          = false -> true
          - fips_enabled                  = false -> null
          - host_encryption_enabled       = false -> null
          ~ kubelet_disk_type             = "OS" -> (known after apply)
          ~ max_count                     = 0 -> 2
          ~ max_pods                      = 250 -> 110
          ~ min_count                     = 0 -> 1
          ~ name                          = "systempool" -> "system" # forces replacement
          ~ node_labels                   = {} -> (known after apply)
          - node_public_ip_enabled        = false -> null
          - only_critical_addons_enabled  = false -> null
          ~ orchestrator_version          = "1.29" -> (known after apply)
          ~ os_disk_size_gb               = 128 -> (known after apply)
          ~ os_sku                        = "Ubuntu" -> (known after apply)
          - tags                          = {} -> null
          + temporary_name_for_rotation   = "systemtemp"
          + workload_runtime              = (known after apply)
          - zones                         = [] -> null
            # (14 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "3cb3aa9d-1fb0-4a37-a6a1-74ae6ed5ae09" -> (known after apply)
          ~ tenant_id    = "48c383d8-47c5-48f9-9e8b-afe4f2519054" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ kubelet_identity (known after apply)
      - kubelet_identity {
          - client_id                 = "e78ce69b-da62-4933-abf7-41d92ad89ffc" -> null
          - object_id                 = "4bb12ed4-a78d-4394-84c6-14bedc939e79" -> null
          - user_assigned_identity_id = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/MC_tf-aks-rg_tf-aks-cluster_northeurope/providers/Microsoft.ManagedIdentity/userAssignedIdentities/tf-aks-cluster-agentpool" -> null
        }

      ~ network_profile {
          ~ dns_service_ip      = "10.0.0.10" -> (known after apply)
          ~ ip_versions         = [
              - "IPv4",
            ] -> (known after apply)
          + network_mode        = (known after apply)
          ~ pod_cidr            = "10.244.0.0/16" -> (known after apply)
          ~ pod_cidrs           = [
              - "10.244.0.0/16",
            ] -> (known after apply)
          ~ service_cidr        = "10.0.0.0/16" -> (known after apply)
          ~ service_cidrs       = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (6 unchanged attributes hidden)

          ~ load_balancer_profile (known after apply)
          - load_balancer_profile {
              - effective_outbound_ips      = [
                  - "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/MC_tf-aks-rg_tf-aks-cluster_northeurope/providers/Microsoft.Network/publicIPAddresses/3adeb6d5-7276-46d8-acd1-91c0cf1ada16",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }

          ~ nat_gateway_profile (known after apply)
        }

      ~ windows_profile (known after apply)
      - windows_profile {
          - admin_username = "azureuser" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_kubernetes_cluster_node_pool.tf-aks_agentpool must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "tf-aks_agentpool" {
      ~ auto_scaling_enabled          = false -> true
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      ~ id                            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/tf-aks-rg/providers/Microsoft.ContainerService/managedClusters/tf-aks-cluster/agentPools/agentpool" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/tf-aks-rg/providers/Microsoft.ContainerService/managedClusters/tf-aks-cluster" -> (known after apply) # forces replacement
      ~ max_count                     = 0 -> 2
      ~ min_count                     = 0 -> 1
      ~ name                          = "agentpool" -> "agent1" # forces replacement
      ~ node_labels                   = {} -> (known after apply)
      - node_public_ip_enabled        = false -> null
      - node_taints                   = [] -> null
      ~ orchestrator_version          = "1.29" -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
      - tags                          = {} -> null
      - zones                         = [] -> null
        # (17 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>